logs/fio/vhost2c/4K2_s1_c32_q4_f16_2.log
precondition: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
rand-read-4K-qd1: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
rand-write-4K-qd1: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
rand-read-4K-qd16: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-write-4K-qd16: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-rw-4K-qd16: (g=5): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-read-4K-qd128: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand-write-4K-qd128: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand-rw-4K-qd128: (g=8): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 99 processes

precondition: (groupid=0, jobs=1): err= 0: pid=2211: Fri Jul 19 11:48:00 2019
  write: IOPS=19.5k, BW=2442MiB/s (2560MB/s)(35.8GiB/15001msec)
    slat (usec): min=5, max=855, avg= 8.21, stdev= 4.27
    clat (usec): min=188, max=1925, avg=807.82, stdev=40.03
     lat (usec): min=198, max=1934, avg=816.74, stdev=40.11
    clat percentiles (usec):
     | 10.000th=[  791], 20.000th=[  791], 30.000th=[  791], 40.000th=[  799],
     | 50.000th=[  799], 70.000th=[  807], 90.000th=[  832], 99.000th=[  922],
     | 99.900th=[ 1303], 99.990th=[ 1745], 99.999th=[ 1909]
   bw (  MiB/s): min= 1844, max= 2399, per=78.92%, avg=1926.95, stdev=93.60, samples=29
   iops        : min=14754, max=19194, avg=15415.10, stdev=748.91, samples=29
  lat (usec)   : 250=0.04%, 500=0.09%, 750=0.10%, 1000=99.52%
  lat (msec)   : 2=0.25%
  cpu          : usr=13.01%, sys=21.11%, ctx=291933, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,293011,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
rand-read-4K-qd1: (groupid=1, jobs=1): err= 0: pid=2220: Fri Jul 19 11:48:00 2019
   read: IOPS=48.6k, BW=190MiB/s (199MB/s)(5693MiB/30001msec)
    slat (usec): min=3, max=741, avg= 3.78, stdev= 2.33
    clat (nsec): min=1159, max=815593, avg=14044.38, stdev=4164.58
     lat (usec): min=13, max=819, avg=18.47, stdev= 4.98
    clat percentiles (usec):
     | 10.000th=[   14], 20.000th=[   14], 30.000th=[   14], 40.000th=[   14],
     | 50.000th=[   14], 70.000th=[   15], 90.000th=[   15], 99.000th=[   23],
     | 99.900th=[   41], 99.990th=[   48], 99.999th=[  750]
   bw (  KiB/s): min=135803, max=183599, per=91.13%, avg=177079.81, stdev=10572.12, samples=59
   iops        : min=33950, max=45899, avg=44269.61, stdev=2643.13, samples=59
  lat (usec)   : 2=0.05%, 4=0.01%, 10=0.04%, 20=98.71%, 50=1.20%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=21.10%, sys=36.22%, ctx=1456141, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1457397,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-write-4K-qd1: (groupid=2, jobs=1): err= 0: pid=2221: Fri Jul 19 11:48:00 2019
  write: IOPS=44.8k, BW=175MiB/s (184MB/s)(5254MiB/30001msec)
    slat (usec): min=3, max=737, avg= 3.87, stdev= 1.97
    clat (nsec): min=1294, max=795912, avg=15568.74, stdev=4894.56
     lat (usec): min=16, max=804, avg=20.11, stdev= 5.45
    clat percentiles (usec):
     | 10.000th=[   15], 20.000th=[   15], 30.000th=[   15], 40.000th=[   15],
     | 50.000th=[   16], 70.000th=[   16], 90.000th=[   17], 99.000th=[   26],
     | 99.900th=[   42], 99.990th=[   51], 99.999th=[  758]
   bw (  KiB/s): min=92413, max=151597, per=72.41%, avg=129861.34, stdev=8965.46, samples=59
   iops        : min=23103, max=37899, avg=32465.02, stdev=2241.43, samples=59
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=97.64%, 50=2.32%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=20.92%, sys=33.57%, ctx=1344500, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1345070,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-read-4K-qd16: (groupid=3, jobs=16): err= 0: pid=2226: Fri Jul 19 11:48:00 2019
   read: IOPS=146k, BW=571MiB/s (599MB/s)(16.7GiB/30028msec)
    slat (usec): min=2, max=87163, avg=34.98, stdev=991.69
    clat (usec): min=5, max=95544, avg=376.65, stdev=3370.60
     lat (usec): min=13, max=95550, avg=414.96, stdev=3524.28
    clat percentiles (usec):
     | 10.000th=[   31], 20.000th=[   32], 30.000th=[   34], 40.000th=[   35],
     | 50.000th=[   37], 70.000th=[   53], 90.000th=[   62], 99.000th=[11338],
     | 99.900th=[52167], 99.990th=[74974], 99.999th=[84411]
   bw (  KiB/s): min=10982, max=99264, per=5.50%, avg=32139.65, stdev=32546.93, samples=945
   iops        : min= 2745, max=24816, avg=8034.54, stdev=8136.73, samples=945
  lat (usec)   : 10=0.01%, 20=0.01%, 50=63.80%, 100=34.08%, 250=0.09%
  lat (usec)   : 500=0.12%, 750=0.09%, 1000=0.07%
  lat (msec)   : 2=0.13%, 4=0.11%, 10=0.45%, 20=0.55%, 50=0.40%
  lat (msec)   : 100=0.12%
  cpu          : usr=5.28%, sys=7.23%, ctx=37793, majf=0, minf=210
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=4389295,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-write-4K-qd16: (groupid=4, jobs=16): err= 0: pid=2242: Fri Jul 19 11:48:00 2019
  write: IOPS=148k, BW=577MiB/s (605MB/s)(16.9GiB/30021msec)
    slat (usec): min=2, max=108026, avg=44.42, stdev=1241.16
    clat (usec): min=5, max=108076, avg=373.01, stdev=3781.45
     lat (usec): min=21, max=108087, avg=421.44, stdev=3995.87
    clat percentiles (usec):
     | 10.000th=[    31], 20.000th=[    33], 30.000th=[    34],
     | 40.000th=[    35], 50.000th=[    37], 70.000th=[    52],
     | 90.000th=[    59], 99.000th=[  4490], 99.900th=[ 61080],
     | 99.990th=[ 85459], 99.999th=[100140]
   bw (  KiB/s): min= 9313, max=308596, per=5.01%, avg=29567.95, stdev=49300.32, samples=944
   iops        : min= 2328, max=77149, avg=7391.62, stdev=12325.07, samples=944
  lat (usec)   : 10=0.01%, 20=0.01%, 50=62.99%, 100=34.97%, 250=0.11%
  lat (usec)   : 500=0.12%, 750=0.08%, 1000=0.07%
  lat (msec)   : 2=0.15%, 4=0.20%, 10=0.54%, 20=0.24%, 50=0.28%
  lat (msec)   : 100=0.26%, 250=0.01%
  cpu          : usr=5.24%, sys=7.35%, ctx=41802, majf=0, minf=153
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,4433544,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-rw-4K-qd16: (groupid=5, jobs=16): err= 0: pid=2280: Fri Jul 19 11:48:00 2019
   read: IOPS=98.3k, BW=384MiB/s (402MB/s)(11.3GiB/30036msec)
    slat (usec): min=2, max=102296, avg=45.75, stdev=1333.09
    clat (usec): min=5, max=112153, avg=376.02, stdev=3921.22
     lat (usec): min=20, max=112165, avg=427.44, stdev=4164.82
    clat percentiles (usec):
     | 10.000th=[    32], 20.000th=[    34], 30.000th=[    35],
     | 40.000th=[    37], 50.000th=[    40], 70.000th=[    55],
     | 90.000th=[    64], 99.000th=[  4490], 99.900th=[ 63177],
     | 99.990th=[ 91751], 99.999th=[102237]
   bw (  KiB/s): min= 3550, max=174054, per=4.41%, avg=17347.21, stdev=30362.38, samples=945
   iops        : min=  887, max=43513, avg=4336.43, stdev=7590.59, samples=945
  write: IOPS=42.1k, BW=165MiB/s (173MB/s)(4945MiB/30036msec)
    slat (usec): min=2, max=112100, avg=44.24, stdev=1274.32
    clat (usec): min=5, max=110583, avg=397.04, stdev=4038.31
     lat (usec): min=23, max=112165, avg=447.53, stdev=4261.27
    clat percentiles (usec):
     | 10.000th=[    32], 20.000th=[    33], 30.000th=[    35],
     | 40.000th=[    36], 50.000th=[    40], 70.000th=[    54],
     | 90.000th=[    64], 99.000th=[  6128], 99.900th=[ 64226],
     | 99.990th=[ 90702], 99.999th=[102237]
   bw (  KiB/s): min= 1846, max=75108, per=4.41%, avg=7440.86, stdev=13018.76, samples=945
   iops        : min=  461, max=18777, avg=1859.83, stdev=3254.69, samples=945
  lat (usec)   : 10=0.01%, 20=0.01%, 50=60.91%, 100=36.97%, 250=0.25%
  lat (usec)   : 500=0.16%, 750=0.10%, 1000=0.07%
  lat (msec)   : 2=0.11%, 4=0.15%, 10=0.52%, 20=0.22%, 50=0.26%
  lat (msec)   : 100=0.28%, 250=0.01%
  cpu          : usr=5.11%, sys=7.42%, ctx=46133, majf=0, minf=173
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=2951284,1265818,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-read-4K-qd128: (groupid=6, jobs=16): err= 0: pid=2312: Fri Jul 19 11:48:00 2019
   read: IOPS=146k, BW=570MiB/s (597MB/s)(16.7GiB/30052msec)
    slat (usec): min=2, max=112026, avg=50.52, stdev=1532.89
    clat (usec): min=5, max=120195, avg=3395.04, stdev=12667.84
     lat (usec): min=24, max=120211, avg=3452.75, stdev=12768.95
    clat percentiles (usec):
     | 10.000th=[   310], 20.000th=[   322], 30.000th=[   330],
     | 40.000th=[   343], 50.000th=[   355], 70.000th=[   562],
     | 90.000th=[   619], 99.000th=[ 64750], 99.900th=[100140],
     | 99.990th=[109577], 99.999th=[115868]
   bw (  KiB/s): min= 9211, max=393270, per=5.57%, avg=32476.90, stdev=78647.84, samples=944
   iops        : min= 2302, max=98317, avg=8118.84, stdev=19661.97, samples=944
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=63.85%, 750=28.13%, 1000=0.14%
  lat (msec)   : 2=0.56%, 4=0.24%, 10=0.73%, 20=1.52%, 50=1.43%
  lat (msec)   : 100=3.31%, 250=0.10%
  cpu          : usr=5.39%, sys=7.14%, ctx=27747, majf=0, minf=656
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=4382620,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand-write-4K-qd128: (groupid=7, jobs=16): err= 0: pid=2328: Fri Jul 19 11:48:00 2019
  write: IOPS=145k, BW=566MiB/s (593MB/s)(16.6GiB/30025msec)
    slat (usec): min=2, max=108062, avg=69.27, stdev=1717.96
    clat (usec): min=8, max=112047, avg=3426.26, stdev=12018.55
     lat (usec): min=22, max=112063, avg=3502.76, stdev=12147.41
    clat percentiles (usec):
     | 10.000th=[   326], 20.000th=[   334], 30.000th=[   343],
     | 40.000th=[   355], 50.000th=[   367], 70.000th=[   545],
     | 90.000th=[   766], 99.000th=[ 64226], 99.900th=[ 92799],
     | 99.990th=[102237], 99.999th=[108528]
   bw (  KiB/s): min= 8579, max=189219, per=4.84%, avg=28016.23, stdev=37723.40, samples=945
   iops        : min= 2144, max=47304, avg=7003.70, stdev=9430.86, samples=945
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=61.09%, 750=28.79%, 1000=0.44%
  lat (msec)   : 2=0.64%, 4=0.22%, 10=0.99%, 20=3.16%, 50=1.91%
  lat (msec)   : 100=2.72%, 250=0.03%
  cpu          : usr=5.28%, sys=7.25%, ctx=32289, majf=0, minf=154
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,4346720,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand-rw-4K-qd128: (groupid=8, jobs=16): err= 0: pid=2362: Fri Jul 19 11:48:00 2019
   read: IOPS=99.8k, BW=390MiB/s (409MB/s)(11.4GiB/30036msec)
    slat (usec): min=2, max=106032, avg=61.84, stdev=1579.61
    clat (usec): min=9, max=115308, avg=3477.64, stdev=12158.39
     lat (usec): min=22, max=115314, avg=3547.33, stdev=12271.06
    clat percentiles (usec):
     | 10.000th=[   330], 20.000th=[   338], 30.000th=[   351],
     | 40.000th=[   363], 50.000th=[   375], 70.000th=[   562],
     | 90.000th=[  1205], 99.000th=[ 66847], 99.900th=[ 92799],
     | 99.990th=[104334], 99.999th=[112722]
   bw (  KiB/s): min= 5955, max=129745, per=6.30%, avg=25132.60, stdev=37702.75, samples=955
   iops        : min= 1488, max=32436, avg=6282.94, stdev=9425.69, samples=955
  write: IOPS=42.8k, BW=167MiB/s (175MB/s)(5025MiB/30036msec)
    slat (usec): min=2, max=100473, avg=62.24, stdev=1599.48
    clat (usec): min=14, max=115311, avg=3465.56, stdev=12125.50
     lat (usec): min=27, max=115317, avg=3535.92, stdev=12242.10
    clat percentiles (usec):
     | 10.000th=[   326], 20.000th=[   338], 30.000th=[   351],
     | 40.000th=[   359], 50.000th=[   375], 70.000th=[   562],
     | 90.000th=[  1205], 99.000th=[ 66323], 99.900th=[ 92799],
     | 99.990th=[103285], 99.999th=[112722]
   bw (  KiB/s): min= 2544, max=56080, per=6.29%, avg=10783.05, stdev=16193.19, samples=955
   iops        : min=  636, max=14020, avg=2695.56, stdev=4048.30, samples=955
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=60.35%, 750=29.07%, 1000=0.31%
  lat (msec)   : 2=0.74%, 4=0.17%, 10=1.38%, 20=3.23%, 50=1.96%
  lat (msec)   : 100=2.75%, 250=0.02%
  cpu          : usr=5.16%, sys=7.36%, ctx=37289, majf=0, minf=169
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=2997800,1286312,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=2442MiB/s (2560MB/s), 2442MiB/s-2442MiB/s (2560MB/s-2560MB/s), io=35.8GiB (38.4GB), run=15001-15001msec

Run status group 1 (all jobs):
   READ: bw=190MiB/s (199MB/s), 190MiB/s-190MiB/s (199MB/s-199MB/s), io=5693MiB (5969MB), run=30001-30001msec

Run status group 2 (all jobs):
  WRITE: bw=175MiB/s (184MB/s), 175MiB/s-175MiB/s (184MB/s-184MB/s), io=5254MiB (5509MB), run=30001-30001msec

Run status group 3 (all jobs):
   READ: bw=571MiB/s (599MB/s), 571MiB/s-571MiB/s (599MB/s-599MB/s), io=16.7GiB (17.0GB), run=30028-30028msec

Run status group 4 (all jobs):
  WRITE: bw=577MiB/s (605MB/s), 577MiB/s-577MiB/s (605MB/s-605MB/s), io=16.9GiB (18.2GB), run=30021-30021msec

Run status group 5 (all jobs):
   READ: bw=384MiB/s (402MB/s), 384MiB/s-384MiB/s (402MB/s-402MB/s), io=11.3GiB (12.1GB), run=30036-30036msec
  WRITE: bw=165MiB/s (173MB/s), 165MiB/s-165MiB/s (173MB/s-173MB/s), io=4945MiB (5185MB), run=30036-30036msec

Run status group 6 (all jobs):
   READ: bw=570MiB/s (597MB/s), 570MiB/s-570MiB/s (597MB/s-597MB/s), io=16.7GiB (17.0GB), run=30052-30052msec

Run status group 7 (all jobs):
  WRITE: bw=566MiB/s (593MB/s), 566MiB/s-566MiB/s (593MB/s-593MB/s), io=16.6GiB (17.8GB), run=30025-30025msec

Run status group 8 (all jobs):
   READ: bw=390MiB/s (409MB/s), 390MiB/s-390MiB/s (409MB/s-409MB/s), io=11.4GiB (12.3GB), run=30036-30036msec
  WRITE: bw=167MiB/s (175MB/s), 167MiB/s-167MiB/s (175MB/s-175MB/s), io=5025MiB (5269MB), run=30036-30036msec

Disk stats (read/write):
  sdb: ios=16170077/12966590, merge=0/0, ticks=207312/415204, in_queue=444392, util=61.32%